app/views/editions/home_picto_edition.html.erb

              <p class="font-book text-primary"> <%= @edition.date.strftime('%d/%m/%Y') %></p>
              <p class="font-book text-primary"><%= @edition.races.pluck(:race_type).join(', ') %> </p>
              <p class="font-book text-primary"> <%= @edition.races.pluck(:name).join(', ') %> </p>
---
SELECT "races"."race_type" FROM "races" WHERE "races"."edition_id" = $1  [["edition_id", 39]]
SELECT "races"."name" FROM "races" WHERE "races"."edition_id" = $1  [["edition_id", 39]]

                  <td>
                    <span class="text-white font-futura"> <%= @edition.pictures.all.count %> </span><br>
---
SELECT COUNT(*) FROM "pictures" WHERE "pictures"."edition_id" = $1  [["edition_id", 39]]

                  <td>
                    <span class="text-white font-futura"> <%= @edition.contacts.all.count %> </span><br>
---
SELECT COUNT(*) FROM "contacts" WHERE "contacts"."edition_id" = $1  [["edition_id", 39]]

                  <td>
                    <span class="text-white font-futura"> <%= @edition.campaigns.all.count %> </span><br>
---
SELECT COUNT(*) FROM "campaigns" WHERE "campaigns"."edition_id" = $1  [["edition_id", 39]]