app/views/events/_event_card.html.erb


      <% if event.editions.blank? %>
---
SELECT  "editions".* FROM "editions" WHERE "editions"."event_id" = $1 ORDER BY "editions"."id" ASC LIMIT $2  [["event_id", 20], ["LIMIT", 1]]
SELECT  1 AS one FROM "editions" WHERE "editions"."event_id" = $1 LIMIT $2  [["event_id", 20], ["LIMIT", 1]]

            <%= edition.date.strftime('%e %b %Y') %><br> <!-- To clear when routes will be cleaned" -->
            <i><%= edition.races.pluck(:race_type).join(', ') %></i> <!-- edition.races.pluck(:name).join(', ') -->
---
SELECT "races"."race_type" FROM "races" WHERE "races"."edition_id" = $1  [["edition_id", 39]]