app/views/events/home_picto.html.erb


      <% if @event.editions.blank? %>
---
SELECT "editions".* FROM "editions" WHERE "editions"."event_id" = $1  [["event_id", 20]]

      <% else %>
        <% @event.editions.order(date: :desc).each do |edition| %>
---
SELECT "editions".* FROM "editions" WHERE "editions"."event_id" = $1 ORDER BY "editions"."date" DESC  [["event_id", 20]]

            <br>
            <span class="courseType"><%= edition.races.pluck(:race_type).join(', ') %> </span> <br>
            <span class="courseName"> <%= edition.races.pluck(:name).join(', ') %> </span>
---
SELECT "races"."race_type" FROM "races" WHERE "races"."edition_id" = $1  [["edition_id", 40]]
SELECT "races"."name" FROM "races" WHERE "races"."edition_id" = $1  [["edition_id", 40]]

              <li>
                <span class="coursePhotos"> <%= edition.pictures.all.count %> </span> <br>
---
SELECT COUNT(*) FROM "pictures" WHERE "pictures"."edition_id" = $1  [["edition_id", 40]]

              <li>
                <span class="courseContacts"> <%= edition.contacts.all.count %> </span> <br>
---
SELECT COUNT(*) FROM "contacts" WHERE "contacts"."edition_id" = $1  [["edition_id", 40]]

              <li>
                <span class="courseCampagnes"> <%= edition.campaigns.all.count %> </span> <br>
---
SELECT COUNT(*) FROM "campaigns" WHERE "campaigns"."edition_id" = $1  [["edition_id", 40]]