app/views/contacts/index.html.erb

SELECT "contacts".* FROM "contacts" WHERE "contacts"."edition_id" = $1  [["edition_id", 39]]
---

							<% @edition.contacts.each do |contact| %>