app/views/photos/index.html.erb

              <%= label_tag 'Catégorie' %>
              <%= select_tag :categ, options_for_select(@edition.results.order(:categ).pluck(:categ).uniq, params[:categ]), multiple: true, class: 'form-control' %>
---
SELECT "results"."categ" FROM "results" WHERE "results"."edition_id" = $1 ORDER BY "results"."categ" ASC  [["edition_id", 40]]