app/controllers/campaigns_controller.rb

SELECT  "editions".* FROM "editions" WHERE "editions"."id" = $1 LIMIT $2  [["id", 39], ["LIMIT", 1]]
---
    def new

        @edition = Edition.find(params[:id])