app/controllers/contacts_controller.rb

    def index
        @edition = Edition.find( params[:edition_id] )
---
SELECT  "editions".* FROM "editions" WHERE "editions"."id" = $1 LIMIT $2  [["id", 39], ["LIMIT", 1]]