app/controllers/editions_controller.rb

UPDATE "editions" SET "description" = $1, "email_sender" = $2, "email_name" = $3, "hashtag" = $4, "results_url" = $5, "template" = $6, "external_link" = $7, "external_link_button" = $8, "sendable_at_home_price_cents" = $9, "download_chargeable_price_cents" = $10, "registration_link" = $11, "updated_at" = $12 WHERE "editions"."id" = $13
---
  def update
    if @edition.update(edition_params)

SELECT COUNT(*) FROM "contacts" WHERE "contacts"."edition_id" = $1  [["edition_id", 39]]
---
  def home_picto_edition
    @has_filter_pict_home = false
    @totalContacts = Contact.where( edition_id: params[:id] ).count || 0

SELECT  "editions".* FROM "editions" WHERE "editions"."id" = $1 LIMIT $2  [["id", 39], ["LIMIT", 1]]
---
  def set_edition
    @edition = Edition.find(params[:edition_id])

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
---
  def set_event
    @event = Event.find params[:event_id]