app/controllers/events_controller.rb

SELECT "photos".* FROM "photos"
---
  def list_picto
    #get the list of all races type
    @courcesType = Race.all.distinct.pluck(:race_type)

    #show only the events related to the current user
    #@events = Event.all.limit(5)

    #@events = current_user.events.pictme.order( created_at: :desc )
    #@eventsfreshAdded = current_user.events.fresh
    #@events = current_user.events.order( created_at: :desc )
    @events = Event.where(user_id: current_user.id).order( created_at: :desc )

    @photos_array = []

    # Event.find(20).editions.find(39).photos.all.each do |photo|
    #   @photos_array << photo.image
    # end

    Photo.all.each do |photo|