app/controllers/events_controller.rb

  def list_picto
    #get the list of all races type
    @courcesType = Race.all.distinct.pluck(:race_type)

    #show only the events related to the current user
    #@events = Event.all.limit(5)

    #@events = current_user.events.pictme.order( created_at: :desc )
    #@eventsfreshAdded = current_user.events.fresh
    #@events = current_user.events.order( created_at: :desc )
    @events = Event.where(user_id: current_user.id).order( created_at: :desc )

    @photos_array = []

    Event.find(20).editions.find(39).photos.all.each do |photo|
      @photos_array << photo.image
    end

    #For sorting
    order = params[:option]
    if ( order == "asc" )
      @events = current_user.events.order( name: :asc )
---
SELECT DISTINCT "races"."race_type" FROM "races"
SELECT "events".* FROM "events" WHERE "events"."user_id" = $1 ORDER BY "events"."created_at" DESC  [["user_id", 1]]
SELECT  "editions".* FROM "editions" WHERE "editions"."event_id" = $1 AND "editions"."id" = $2 LIMIT $3  [["event_id", 20], ["id", 39], ["LIMIT", 1]]
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
SELECT "photos".* FROM "photos" WHERE "photos"."edition_id" = $1  [["edition_id", 39]]
SELECT "races"."race_type" FROM "races" WHERE "races"."edition_id" = $1  [["edition_id", 39]]
SELECT "events".* FROM "events" INNER JOIN "sportpics" ON "events"."id" = "sportpics"."event_id" WHERE "sportpics"."user_id" = $1 ORDER BY "events"."name" DESC  [["user_id", 1]]