app/controllers/photos_controller.rb

  def index

    #IDS are not INTEGER

    #photo_ids = PhotoSearchService.new(@edition, params).fetch_ids
   # @photos = @edition.photos.where(id: photo_ids).paginate(page: params[:page], per_page: 30).order(created_at: :desc)

    @photos = @edition.photos.paginate(page: params[:page], per_page: 30).order(created_at: :desc)
---
SELECT  "photos"."id" FROM "photos" WHERE "photos"."edition_id" = $1 ORDER BY "photos"."created_at" DESC LIMIT $2 OFFSET $3  [["edition_id", 39], ["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "photos" WHERE "photos"."edition_id" = $1  [["edition_id", 39]]

  def new
    @photo = Photo.new
    @photosCount = @edition.photos.all.count
---
SELECT COUNT(*) FROM "photos" WHERE "photos"."edition_id" = $1  [["edition_id", 39]]

  def add_edition_photos
    errors_array = []
    images_params[:images].each do |img|
      photo = Photo.new
      photo.image.attach(img)
---
INSERT INTO "photos" ("created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "edition_id", "direct_image_url") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def destroy_all
    @photos = @edition.photos.where(id: params[:photo_ids])
    @photos.destroy_all
---
SELECT "photos".* FROM "photos" WHERE "photos"."edition_id" = $1 AND "photos"."id" IN ($2, $3)  [["edition_id", 40], ["id", "889ff472-5c23-47bd-8f0f-4e7279034bd9"], ["id", "7c4a050f-70cd-4645-a937-752e03509f50"]]
DELETE FROM "photos" WHERE "photos"."id" = $1  [["id", "7c4a050f-70cd-4645-a937-752e03509f50"]]

  def set_event
    @event = Event.find params[:event_id]
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]

  def set_edition
    @edition = Edition.find params[:edition_id]
---
SELECT  "editions".* FROM "editions" WHERE "editions"."id" = $1 LIMIT $2  [["id", 40], ["LIMIT", 1]]